# ElementPhaseStatusFilter Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementPhaseStatusFilter Properties
ElementPhaseStatusFilter Class See Also
---
The ElementPhaseStatusFilter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.  (Inherited from ElementFilter.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ElementFilter.) |
| PhaseId | The phase id. |

# See Also
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace